tangyangguang/Stc8hBase/drivers/drv_ec11.h
#ifndef DRV_EC11_H
#define DRV_EC11_H

#include "stc8h_config.h"

#ifndef DRV_EC11_FAST_THRESHOLD_MS
#define DRV_EC11_FAST_THRESHOLD_MS 50u
#endif

#ifndef DRV_EC11_FAST_STEP
#define DRV_EC11_FAST_STEP 10
#endif

#ifndef DRV_EC11_REVERSE
#define DRV_EC11_REVERSE 0u
#endif

typedef struct {
    stc8h_u8 last_state;
    stc8h_u8 has_last_detent;
    stc8h_u8 reverse;
    stc8h_s8 step_accum;
    stc8h_s8 fast_step;
    stc8h_u16 detent_elapsed_ms;
    stc8h_u16 fast_threshold_ms;
    stc8h_s16 delta;
} drv_ec11_t;

void drv_ec11_init(drv_ec11_t *ec11);
void drv_ec11_set_fast(drv_ec11_t *ec11, stc8h_u16 threshold_ms, stc8h_s8 fast_step);
void drv_ec11_set_reverse(drv_ec11_t *ec11, stc8h_u8 reverse);
void drv_ec11_scan(drv_ec11_t *ec11, stc8h_u8 a_level, stc8h_u8 b_level, stc8h_u16 elapsed_ms);
stc8h_s16 drv_ec11_get_delta(drv_ec11_t *ec11);

#endif
